Mictilt/modem_console_esp32/main/modem_console_main.cpp
    const struct StartApArgs
    {
        StartApArgs() : ssid(STR1, nullptr, nullptr, "<ssid>", "AP SSID name"),
                        password(STR0, "p", "password", "<password>", "AP password (optional)"),
                        channel(INT0, "c", "channel", "<channel>", "WiFi channel (default: 1)") {}
        CommandArgs ssid;
        CommandArgs password;
        CommandArgs channel;
    } start_ap_args;

    const ConsoleCommand StartAP("start_ap", "Start WiFi AP with PPPoS connection sharing", &start_ap_args, sizeof(start_ap_args), [&](ConsoleCommand *c)
                                 {
        auto ssid = c->get_string_of(&StartApArgs::ssid);
        auto password = c->get_string_of(&StartApArgs::password);
        auto channel = c->get_count_of(&StartApArgs::channel) ? c->get_int_of(&StartApArgs::channel) : 1;
        
        ESP_LOGI(TAG, "Initializing WiFi Access Point");
        
         // Create default AP network interface
         esp_netif_t *ap_netif = esp_netif_create_default_wifi_ap();
         assert(ap_netif);
         // Get DNS from PPP interface and set it for AP DHCP server
         esp_netif_dns_info_t dns;
         esp_err_t err = esp_netif_get_dns_info(esp_netif, ESP_NETIF_DNS_MAIN, &dns);
         if (err != ESP_OK) {
             ESP_LOGE(TAG, "Failed to get DNS info: %s", esp_err_to_name(err));
          return -1;  // Return an error or handle appropriately
         }
 
         set_dhcps_dns(ap_netif, dns.ip.u_addr.ip4.addr);
        // Initialize Wi-Fi
        wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
        ESP_ERROR_CHECK(esp_wifi_init(&cfg));
        
        // Register event handler
        ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT,
                        ESP_EVENT_ANY_ID,
                        &wifi_event_handler,
                        NULL,
                        NULL));
    
        // Configure AP
        wifi_config_t wifi_config = {};
        wifi_config.ap.channel = static_cast<uint8_t>(channel);
        wifi_config.ap.max_connection = 4;
        wifi_config.ap.authmode = password.empty() ? WIFI_AUTH_OPEN : WIFI_AUTH_WPA2_PSK;
    
        // Copy SSID and password to config
        strncpy((char*)wifi_config.ap.ssid, ssid.c_str(), sizeof(wifi_config.ap.ssid) - 1);
        wifi_config.ap.ssid_len = strlen(ssid.c_str());
        if (!password.empty()) {
            strncpy((char*)wifi_config.ap.password, password.c_str(), sizeof(wifi_config.ap.password) - 1);
        }
    
       
        // Configure AP
        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_AP));
        ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &wifi_config));
    
        // Start WiFi
        ESP_ERROR_CHECK(esp_wifi_start());
        if(esp_netif_is_netif_up(ap_netif) != true){
            ESP_LOGI(TAG, "Failed to start AP");
        } else {
            ESP_LOGI(TAG, "AP started successfully");
        }
        // Enable NAT
        ESP_LOGI(TAG, "Enabling NAT on interface %lu", _g_esp_netif_soft_ap_ip.ip.addr);
        ip_napt_enable(_g_esp_netif_soft_ap_ip.ip.addr, 1);
    
        ESP_LOGI(TAG, "AP started successfully");
        ESP_LOGI(TAG, "SSID: %s", ssid.c_str());
        if (!password.empty()) {
            ESP_LOGI(TAG, "Password: %s", password.c_str());
        }
        ESP_LOGI(TAG, "Channel: %d", channel);
    
        return 0; });

    const struct SetApn
    {
        SetApn() : apn(STR1, nullptr, nullptr, "<apn>", "APN (Access Point Name)") {}
        CommandArgs apn;
    } set_apn;
    const ConsoleCommand SetApnParser("set_apn", "sets APN", &set_apn, sizeof(set_apn), [&](ConsoleCommand *c)
                                      {
        if (c->get_count_of(&SetApn::apn)) {
            auto apn = c->get_string_of(&SetApn::apn);
            ESP_LOGI(TAG, "Setting the APN=%s...", apn.c_str());
            strcpy(apn_rtc, apn.c_str());
            auto new_pdp = std::unique_ptr<PdpContext>(new PdpContext(apn));
            dce->get_module()->configure_pdp_context(std::move(new_pdp));
            ESP_LOGI(TAG, "OK");
        }
        return 0; });

    const ConsoleCommand ExitConsole("exit", "exit the console application", no_args, [&](ConsoleCommand *c)
                                     {
        ESP_LOGI(TAG, "Exiting...");
        exit_signal.set(1);
        return 0; });

    /* Put the esp32 into deep sleep */
    const struct DeepSleepArgs
    {
        DeepSleepArgs() : timeout(INT1, nullptr, nullptr, "<tout>", "TIMEOUT") {}
        CommandArgs timeout;
    } deep_sleep_args;
    const ConsoleCommand SetDeepSleep("set_deep_sleep", "Put esp32 to deep sleep", &deep_sleep_args, sizeof(deep_sleep_args), [&](ConsoleCommand *c)
                                      {
        int tout = c->get_int_of(&DeepSleepArgs::timeout);
        ESP_LOGI(TAG, "Entering deep sleep for %d sec", tout);
        ESP_LOGI(TAG, "Wakeup Cause: %d ", esp_sleep_get_wakeup_cause());
        esp_deep_sleep(tout * 1000000);
        return 0; });

    /* Wake up modem */
    const ConsoleCommand WakeupModem("wakeup_modem", "Wakes up the modem from PSM", no_args, [&](ConsoleCommand *c)
                                     {
        wakeup_modem();
        ESP_LOGI(TAG, "OK");
        return 0; });

    /* Enable PSM modem */
    const ConsoleCommand EnablePSM("enable_psm", "Enables PSM on the modem", no_args, [&](ConsoleCommand *c)
                                   {
        std::string out;
        CHECK_ERR(dce->at("AT+CPSMS=1", out, 500), ESP_LOGI(TAG, "OK. %s", out.c_str()));
        return 0; });

    /* Disable PSM modem */
    const ConsoleCommand DisablePSM("disable_psm", "Disables PSM on the modem", no_args, [&](ConsoleCommand *c)
                                    {
        std::string out;
        CHECK_ERR(dce->at("AT+CPSMS=0", out, 500),   ESP_LOGI(TAG, "OK. %s", out.c_str()));
        return 0; });

    /* Get modem PSM cfg */
    const ConsoleCommand GetModemCfg("get_psm_cfg", "Get PSM config", no_args, [&](ConsoleCommand *c)
                                     {
        std::string out;
        CHECK_ERR(dce->at("AT+CPSMS?", out, 500),  ESP_LOGI(TAG, "OK. %s", out.c_str()));
        return 0; });

    /* Set modem PSM config */
    const struct SetPsmCfgArgs
    {
        SetPsmCfgArgs() : periodic_tau(STR1, nullptr, nullptr, "<Requested_Periodic-TAU>", "T3412 Timer in 8-bit format"),
                          active_time(STR0, nullptr, nullptr, "<Requested_Active-Time>", "T3324 Timer in 8-bit format") {}
        CommandArgs periodic_tau;
        CommandArgs active_time;
    } set_psm_cfg_args;
    const ConsoleCommand SetPsmCfg("set_psm_cfg", "Set PSM config", &set_psm_cfg_args, sizeof(set_psm_cfg_args), [&](ConsoleCommand *c)
                                   {
        std::string out;
        auto periodic_tau = c->get_string_of(&SetPsmCfgArgs::periodic_tau);
        auto active_time = c->get_string_of(&SetPsmCfgArgs::active_time);

        /* Validate input */
        if ((strlen(periodic_tau.c_str()) != strlen("00000000")) ||
                (strlen(active_time.c_str()) != strlen("00000000"))) {
            ESP_LOGE(TAG, "Failed with ERROR: Invalid argument length");
            return 1;
        }

        /* Get PSM config */
        dce->at("AT+CPSMS?", out, 500);

        /* Update PSM config */
        if (out.size() > 8) {
            std::string set_cmd = "AT+CPSMS=" + std::to_string(out.c_str()[8] - '0') + ",,,\"" + periodic_tau.c_str() + "\",\"" + active_time.c_str() + "\"";
            CHECK_ERR(dce->at(set_cmd, out, 500),  ESP_LOGI(TAG, "OK. %s", out.c_str()));
        } else {
            ESP_LOGE(TAG, "Failed with ERROR: Invalid AT+CPSMS? return length");
        }

        return 0; });

    // start console REPL
    ESP_ERROR_CHECK(esp_console_start_repl(s_repl));
    // wait for exit
    exit_signal.wait_any(1, UINT32_MAX);
    s_repl->del(s_repl);
    ESP_LOGI(TAG, "Exiting...%" PRIu32, esp_get_free_heap_size());
#if defined(CONFIG_EXAMPLE_SERIAL_CONFIG_USB)
    // USB example runs in a loop to demonstrate hot-plugging and sudden disconnection features.
} // while (1)
#endif
}
